let StartDate = ago(7d);
let OperationNameMatch = "Add group";
let O365GroupNameFilter = "<nameOfGroup>";
AuditLogs
| where TimeGenerated > StartDate
| where OperationName contains OperationNameMatch
| where TargetResources has "Unified"
| where TargetResources has O365GroupNameFilter
| project InitiatedBy
| mvexpand InitiatedBy
| evaluate bag_unpack(InitiatedBy)
| evaluate bag_unpack(user)